ComEngineering/Monitoring_Hardware/Project_PROG/Monitoring_STM32F030R8T6_v1.0/Source/one_wire_ds18b20.h
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __ONE_WIRE_DS18B20_H
#define __ONE_WIRE_DS18B20_H


/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx.h"
#include "delay.h"
#include "DATA.h"

/* Private typedef -----------------------------------------------------------*/
 
 
/* Private function prototypes -----------------------------------------------*/
uint8_t one_wire_ini_setting(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);
uint8_t send_presence(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);
void one_wire_write_bit(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, uint8_t bit);
uint8_t one_wire_read_bit(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);
uint8_t read_byte(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);
void one_wire_write_byte(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, uint8_t data);
void one_ware_convert_t(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);
uint16_t one_wire_read_byte(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);
uint8_t ow_crc(uint8_t x);
void pin_IN(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);
void pin_OUT_OD(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);
void pin_OUT_PP(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);


#endif /* __ONE_WIRE_DS18B20_H */
